
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 2 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_resource_group.rg
* Update
  * azurerm_key_vault_secret.redis_access_key
  * azurerm_key_vault_secret.redis_connection_string
* Replace
  * module.redis-cache.azurerm_private_endpoint.this[0]
  * module.redis-cache.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_access_key" {
        id                      = "https://ia-aat.vault.azure.net/secrets/ia-redis-access-key/442b9fb76b714e82b49fd8f6ec6ce3f6"
        name                    = "ia-redis-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.redis_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_connection_string" {
      - content_type            = "" -> null
        id                      = "https://ia-aat.vault.azure.net/secrets/ia-redis-connection-string/881c4e0b253a4ea2823cc1daf06eda17"
        name                    = "ia-redis-connection-string"
        tags                    = {}
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ia-aip-frontend-aat"
      + tags     = (known after apply)
    }

  # module.redis-cache.azurerm_private_endpoint.this[0] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-cache-aat/providers/Microsoft.Network/privateEndpoints/ia-aat" -> (known after apply)
        name                     = "ia-aat"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-cache-aat/providers/Microsoft.Network/networkInterfaces/ia-aat.nic.922a39d5-db40-43a3-931f-4753aaaa40db"
              - name = "ia-aat.nic.922a39d5-db40-43a3-931f-4753aaaa40db"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-cache-aat/providers/Microsoft.Network/privateEndpoints/ia-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.redis.cache.windows.net"
              - name                = "privatelink.redis.cache.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ia-aat.privatelink.redis.cache.windows.net"
                      - ip_addresses = [
                          - "10.96.136.12",
                        ]
                      - name         = "ia-aat"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "application"         = "immigration"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/ia-aip-frontend.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ia-tech"
            "environment"         = "staging"
            "managedBy"           = "Immigration"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-cache-aat/providers/Microsoft.Network/privateEndpoints/ia-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup" -> (known after apply)
            name                 = "redis-endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "ia-aat"
          ~ private_connection_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-cache-aat/providers/Microsoft.Cache/redis/ia-aat" -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.96.136.12" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.redis-cache.azurerm_redis_cache.redis must be replaced
-/+ resource "azurerm_redis_cache" "redis" {
      ~ family                        = "P" -> "C"
      ~ hostname                      = "ia-aat.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-cache-aat/providers/Microsoft.Cache/redis/ia-aat" -> (known after apply)
        name                          = "ia-aat"
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      ~ redis_version                 = "6.0" -> "6"
      ~ replicas_per_master           = 0 -> (known after apply)
      ~ replicas_per_primary          = 0 -> (known after apply)
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      ~ sku_name                      = "Premium" -> "Basic" # forces replacement
      ~ ssl_port                      = 6380 -> (known after apply)
        tags                          = {
            "application"         = "immigration"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/ia-aip-frontend.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ia-tech"
            "environment"         = "staging"
            "managedBy"           = "Immigration"
        }
      - tenant_settings               = {} -> null
      - zones                         = [] -> null
        # (6 unchanged attributes hidden)

      ~ redis_configuration {
          - aof_backup_enabled              = false -> null
          ~ maxclients                      = 7500 -> (known after apply)
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
            # (5 unchanged attributes hidden)
        }
    }

Plan: 3 to add, 2 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1259,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->